spec/spec/SVWS/InstantIssue/examples/InstantIssue.getCardInfoRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins="http://bpc.ru/sv/instantissueWS/">
  <soapenv:Header xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <wsse:Security>
         <wsse:UsernameToken>
            <wsse:Username>admin</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">admin</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <ins:getCardInfoRequest>
         <ins:applId>123</ins:applId>
       <ins:includeLimits>true</ins:includeLimits>
         <ins:lang>LANGENG</ins:lang>
     </ins:getCardInfoRequest>
   </soapenv:Body>
</soapenv:Envelope>