spec/spec/SVWS/InstantIssue/examples/InstantIssue.processIBGDataRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                  xmlns:ins="http://bpc.ru/sv/instantissueWS/" 
                  xmlns:car="http://bpc.ru/sv/SVXP/cardSecure">
   <soapenv:Header xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" 
                   xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <wsse:Security>
         <wsse:UsernameToken>
            <wsse:Username>admin</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">admin</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <ins:processIBGDataRequest>
         <car:card_id>321874571235</car:card_id>
         <car:expiration_date>2019-07-30</car:expiration_date>
         <car:state>CSTE0400</car:state>
         <car:card_security>
            <car:PVV>1234</car:PVV>
            <car:PIN_block>456</car:PIN_block>
            <car:key_index>7</car:key_index>
            <car:PIN_block_format>PNBFISO1</car:PIN_block_format>
         </car:card_security>
         <car:issue_date>2017-06-14</car:issue_date>
      </ins:processIBGDataRequest>
   </soapenv:Body>
</soapenv:Envelope>